[
  {
    "id": "why-i-built-this-site",
    "title": "Why I Built This Site",
    "slug": "why-i-built-this-site",
    "excerpt": "Things were getting out of hand. Multiple companies, new products every week, and projects scattered everywhere. I needed one place to keep it all under control.",
    "content": "Things were getting out of hand.\n\nI was running multiple companies, building new products every week, and my projects were scattered everywhere. GoSYNQ here, Dizzy Otter there, the AI Academy somewhere else. No central hub. No clear story. Just a bunch of things I'd built floating around the internet.\n\nI needed one place to keep it all under control.\n\nMore importantly, I needed accountability. It's easy to build things in private and never finish them. It's harder to ship publicly when people are watching.\n\nSo here's the deal: every week, I'm releasing a new project. Every week, I'm writing about what I learned, what went wrong, what worked, and what's next. No sugarcoating. No highlight reel. Just the real process of running multiple startups while building in public.\n\nThis site is my command center. Everything I build, everything I'm working on, all in one place. If you want to follow the journey, this is where it happens.\n\nI'll be sharing on socials too, but the real updates live here. The struggles, the wins, the late nights fixing bugs, the client calls that change everything. All of it.\n\nThe goal isn't just to document what I'm doing. It's to provide actual value to the tech and business space. If you're building something, you'll probably relate to a lot of this. If you're thinking about starting, maybe this helps you take the leap.\n\nEither way, welcome. Let's build something.",
    "author": "Charlie Swinhoe",
    "date": "2025-01-15",
    "readTime": 3,
    "tags": ["Journey", "Building in Public", "Startups"],
    "image": "https://images.unsplash.com/photo-1499750310107-5fef28a66643?w=1200&q=80",
    "featured": true
  },
  {
    "id": "how-dizzy-otter-became-what-it-is",
    "title": "How Dizzy Otter Became What It Is Today",
    "slug": "how-dizzy-otter-became-what-it-is",
    "excerpt": "Dizzy Otter started because I needed to get paid. Turns out, it became so much more. From a simple invoice to industry-changing technology in under a year.",
    "content": "Dizzy Otter started because I needed to get paid.\n\nI had my first real freelance project and needed a registered business to invoice the client. So I registered Dizzy Otter Ltd, did the work, got paid, and figured that was that.\n\nTurns out, it wasn't.\n\nOver the next few months, I started getting more work. Startups, established businesses, sole traders. Everyone needed help with the same things: better websites, stronger SEO, smarter use of AI. I realized there was real demand for this, especially locally. So many businesses were leaving money on the table because their digital presence was weak or nonexistent.\n\nSo Dizzy Otter became a web design and SEO consultancy. We helped businesses improve their online visibility, attract more clients, and actually use their websites as a tool instead of just having one because everyone else did.\n\nBut things shifted again.\n\nThe more I worked with AI tools to streamline client operations, the more I realized that's where the real value was. Not just building websites. Building intelligent systems that solve actual problems. Automating workflows. Creating custom AI solutions that save people hours every week.\n\nSo we pivoted. Dizzy Otter became an AI consultancy and software development company.\n\nWe help businesses modernize their operations with AI powered systems. Custom Notion dashboards that actually work. Personalized GPTs trained on their data. Automated outreach systems that don't feel automated. Real solutions that make people's jobs easier so they can focus on what they're actually good at.\n\nAround this time, I brought in Joe Evans. Close friend, sharp mind, and exactly the kind of person I needed to handle growth. Now we're a team.\n\nWe work with clients across multiple industries. Every problem is different. Every solution is custom. And right now, we're in talks with some big players about software that could genuinely shift how their industry operates.\n\nDizzy Otter went from \"I need to invoice someone\" to \"we're building industry changing technology\" in less than a year.\n\nAnd we're just getting started.\n\nWant to work with us? Get in touch at [dizzyotter.com](https://dizzyotter.com)",
    "author": "Charlie Swinhoe",
    "date": "2025-01-15",
    "readTime": 4,
    "tags": ["Dizzy Otter", "Business Story", "AI Consulting"],
    "image": "https://images.unsplash.com/photo-1620712943543-bcc4688e7485?w=1200&q=80",
    "featured": true
  }
]
